app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password", "email", "real_name", "encrypted_password", "salt") VALUES ('2011-11-22 05:13:45.863273', '2011-11-22 05:13:45.863273', 'tomuselman', 'hotwheels', 'thomasuselman@gmail.com', 'Tom Uselman', NULL, NULL)

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "password" = 'hotwheels21', "email" = 'jo@gmail.com', "real_name" = 'John', "updated_at" = '2011-10-20 00:05:10.874894' WHERE "users"."id" = 1